Revit 2024 API
FabricSheetType.OverallLength Property
 The length of the wire sheet (including overhangs) in the major direction.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2013
Syntax
C#
public double OverallLength { get; }
Visual Basic
Public ReadOnly Property OverallLength As Double
	Get
Visual C++
public:
property double OverallLength {
	double get ();
}
See Also
FabricSheetType Class
Autodesk.Revit.DB.Structure Namespace